15631812606/stm32-f411-demo/Code/HARDWARE/DMA/dma.c
#include "dma.h"
#include "stm32f4xx_conf.h"
#include "stm32f4xx_dma.h"

#define DMA2_Stream DMA2_Stream0

//DM2初始化（用于存储器到外设进行传输数据，使用外设是串口1发送）
//增加串口的DMA接收功能
void Usart1_DMA2_init(void)
{
    DMA_InitTypeDef DMA_InitStructure;
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2,ENABLE); //使能DMA2的时钟

    //-------------------------------串口DMA发送部分--------------------------------------------------
    DMA_DeInit(DMA2_Stream7);                           //复位DMA2流0
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                      //DMA数据流通道选择
    DMA_InitStructure.DMA_PeripheralBaseAddr = (USART1_BASE+0x04);      //源数据地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)SRC_Buffer;       //目标地址(外设)
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;             //存储器到usart1外设模式
    DMA_InitStructure.DMA_BufferSize = (uint32_t)10;                    //数据流大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;    //关闭外设地址自动递增功能
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;             //使能源数据地址自动递增
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;     //目标数据字大小
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;//源数据字大小
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                     //一次模式（存储器到存储器不能循环传输）
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;               //优先级高
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;              //禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;        
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;         //单次模式
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single; //单次模式
    DMA_Init(DMA2_Stream7,&DMA_InitStructure);
    DMA_Cmd(DMA2_Stream7,ENABLE);   //开启DMA发送通道

    //-------------------------------串口DMA接收部分--------------------------------------------------
    DMA_DeInit(DMA2_Stream5);                           //复位DMA2流
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                      //DMA数据流通道选择
    DMA_InitStructure.DMA_PeripheralBaseAddr = (USART1_BASE+0x04);      //源数据地址(外设)
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)DST_Buffer;       //目标地址（内存）
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;             //usart1外设到存储器模式
    DMA_InitStructure.DMA_BufferSize = (uint32_t)1000;                    //数据流大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;    //关闭外设地址自动递增功能
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;             //使能源数据地址自动递增
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;     //目标数据字大小
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;//源数据字大小
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;                       //一次模式（存储器到存储器不能循环传输）
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;               //优先级高
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;              //禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;        
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;         //单次模式
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single; //单次模式
    DMA_Init(DMA2_Stream5,&DMA_InitStructure);
    DMA_Cmd(DMA2_Stream5,ENABLE);   //开启DMA发送通道
}

//DM2初始化（用于存储器到存储器进行传输数据，只能使用DMA2）
void DMA2_init(void)
{
    DMA_InitTypeDef DMA_InitStructure;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2,ENABLE);//使能DMA2的时钟
    DMA_DeInit(DMA2_Stream);       //复位DMA2流0

    DMA_InitStructure.DMA_Channel = DMA_Channel_0;      //DMA数据流通道选择
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)SRC_Buffer;    //源数据地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)DST_Buffer;       //目标地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToMemory;                 //存储器到存储器模式
    DMA_InitStructure.DMA_BufferSize = (uint32_t)BUFFER_SIZE;           //数据流大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;     //使能源地址自动递增功能
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;             //使能目标地址自动递增
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;     //目标数据字大小
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;//源数据字大小
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                       //一次模式（存储器到存储器不能循环传输）
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;                 //优先级高
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;              //禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;        
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;         //单次模式
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single; //单次模式
    DMA_Init(DMA2_Stream,&DMA_InitStructure);
    DMA_Cmd(DMA2_Stream,ENABLE);
}



